qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x0100</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x18000000</baseAddress>
      <description>DW_apb_ssi has the following features:\n
        * APB interface – Allows for easy integration into a DesignWare Synthesizable Components for AMBA 2 implementation.\n
        * APB3 and APB4 protocol support.\n
        * Scalable APB data bus width – Supports APB data bus widths of 8, 16, and 32 bits.\n
        * Serial-master or serial-slave operation – Enables serial communication with serial-master or serial-slave peripheral devices.\n
        * Programmable Dual/Quad/Octal SPI support in Master Mode.\n
        * Dual Data Rate (DDR) and Read Data Strobe (RDS) Support - Enables the DW_apb_ssi master to perform operations with the device in DDR and RDS modes when working in Dual/Quad/Octal mode of operation.\n
        * Data Mask Support - Enables the DW_apb_ssi to selectively update the bytes in the device. This feature is applicable only in enhanced SPI modes.\n
        * eXecute-In-Place (XIP) support - Enables the DW_apb_ssi master to behave as a memory mapped I/O and fetches the data from the device based on the APB read request. This feature is applicable only in enhanced SPI modes.\n
        * DMA Controller Interface – Enables the DW_apb_ssi to interface to a DMA controller over the bus using a handshaking interface for transfer requests.\n
        * Independent masking of interrupts – Master collision, transmit FIFO overflow, transmit FIFO empty, receive FIFO full, receive FIFO underflow, and receive FIFO overflow interrupts can all be masked independently.\n
        * Multi-master contention detection – Informs the processor of multiple serial-master accesses on the serial bus.\n
        * Bypass of meta-stability flip-flops for synchronous clocks – When the APB clock (pclk) and the DW_apb_ssi serial clock (ssi_clk) are synchronous, meta-stable flip-flops are not used when transferring control signals across these clock domains.\n
        * Programmable delay on the sample time of the received serial data bit (rxd); enables programmable control of routing delays resulting in higher serial data-bit rates.\n
        * Programmable features:\n
        - Serial interface operation – Choice of Motorola SPI, Texas Instruments Synchronous Serial Protocol or National Semiconductor Microwire.\n
        - Clock bit-rate – Dynamic control of the serial bit rate of the data transfer; used in only serial-master mode of operation.\n
        - Data Item size (4 to 32 bits) – Item size of each data transfer under the control of the programmer.\n
        * Configured features:\n
        - FIFO depth – 16 words deep. The FIFO width is fixed at 32 bits.\n
        - 1 slave select output.\n
        - Hardware slave-select – Dedicated hardware slave-select line.\n
        - Combined interrupt line - one combined interrupt line from the DW_apb_ssi to the interrupt controller.\n
        - Interrupt polarity – active high interrupt lines.\n
        - Serial clock polarity – low serial-clock polarity directly after reset.\n
        - Serial clock phase – capture on first edge of serial-clock directly after reset.</description>
      <name>XIP_SSI</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>Control register 0</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[24:24]</bitRange>
              <description>Slave select toggle enable</description>
              <name>SSTE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[22:21]</bitRange>
              <description>SPI frame format</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Standard 1-bit SPI frame format; 1 bit per SCK, full-duplex</description>
                  <name>STD</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Dual-SPI frame format; two bits per SCK, half-duplex</description>
                  <name>DUAL</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Quad-SPI frame format; four bits per SCK, half-duplex</description>
                  <name>QUAD</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>SPI_FRF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[20:16]</bitRange>
              <description>Data frame size in 32b transfer mode\n
                Value of n -&gt; n+1 clocks per frame.</description>
              <name>DFS_32</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:12]</bitRange>
              <description>Control frame size\n
                Value of n -&gt; n+1 clocks per frame.</description>
              <name>CFS</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Shift register loop (test mode)</description>
              <name>SRL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Slave output enable</description>
              <name>SLV_OE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:8]</bitRange>
              <description>Transfer mode</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Both transmit and receive</description>
                  <name>TX_AND_RX</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Transmit only (not for FRF == 0, standard SPI mode)</description>
                  <name>TX_ONLY</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Receive only (not for FRF == 0, standard SPI mode)</description>
                  <name>RX_ONLY</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>EEPROM read mode (TX then RX; RX starts after control data TX'd)</description>
                  <name>EEPROM_READ</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>TMOD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Serial clock polarity</description>
              <name>SCPOL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Serial clock phase</description>
              <name>SCPH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Frame format</description>
              <name>FRF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <description>Data frame size</description>
              <name>DFS</name>
            </field>
          </fields>
          <name>CTRLR0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>Master Control register 1</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <description>Number of data frames</description>
              <name>NDF</name>
            </field>
          </fields>
          <name>CTRLR1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0008</addressOffset>
          <description>SSI Enable</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>SSI enable</description>
              <name>SSI_EN</name>
            </field>
          </fields>
          <name>SSIENR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x000c</addressOffset>
          <description>Microwire Control</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Microwire handshaking</description>
              <name>MHS</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Microwire control</description>
              <name>MDD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Microwire transfer mode</description>
              <name>MWMOD</name>
            </field>
          </fields>
          <name>MWCR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0010</addressOffset>
          <description>Slave enable</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>For each bit:\n
                0 -&gt; slave not selected\n
                1 -&gt; slave selected</description>
              <name>SER</name>
            </field>
          </fields>
          <name>SER</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0014</addressOffset>
          <description>Baud rate</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <description>SSI clock divider</description>
              <name>SCKDV</name>
            </field>
          </fields>
          <name>BAUDR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0018</addressOffset>
          <description>TX FIFO threshold level</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Transmit FIFO threshold</description>
              <name>TFT</name>
            </field>
          </fields>
          <name>TXFTLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x001c</addressOffset>
          <description>RX FIFO threshold level</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Receive FIFO threshold</description>
              <name>RFT</name>
            </field>
          </fields>
          <name>RXFTLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0020</addressOffset>
          <description>TX FIFO level</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[7:0]</bitRange>
              <description>Transmit FIFO level</description>
              <name>TFTFL</name>
            </field>
          </fields>
          <name>TXFLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0024</addressOffset>
          <description>RX FIFO level</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[7:0]</bitRange>
              <description>Receive FIFO level</description>
              <name>RXTFL</name>
            </field>
          </fields>
          <name>RXFLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0028</addressOffset>
          <description>Status register</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[6:6]</bitRange>
              <description>Data collision error</description>
              <name>DCOL</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <description>Transmission error</description>
              <name>TXE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <description>Receive FIFO full</description>
              <name>RFF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <description>Receive FIFO not empty</description>
              <name>RFNE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <description>Transmit FIFO empty</description>
              <name>TFE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>Transmit FIFO not full</description>
              <name>TFNF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>SSI busy flag</description>
              <name>BUSY</name>
            </field>
          </fields>
          <name>SR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x002c</addressOffset>
          <description>Interrupt mask</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <description>Multi-master contention interrupt mask</description>
              <name>MSTIM</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>Receive FIFO full interrupt mask</description>
              <name>RXFIM</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Receive FIFO overflow interrupt mask</description>
              <name>RXOIM</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Receive FIFO underflow interrupt mask</description>
              <name>RXUIM</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Transmit FIFO overflow interrupt mask</description>
              <name>TXOIM</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Transmit FIFO empty interrupt mask</description>
              <name>TXEIM</name>
            </field>
          </fields>
          <name>IMR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0030</addressOffset>
          <description>Interrupt status</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <description>Multi-master contention interrupt status</description>
              <name>MSTIS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <description>Receive FIFO full interrupt status</description>
              <name>RXFIS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <description>Receive FIFO overflow interrupt status</description>
              <name>RXOIS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <description>Receive FIFO underflow interrupt status</description>
              <name>RXUIS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>Transmit FIFO overflow interrupt status</description>
              <name>TXOIS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Transmit FIFO empty interrupt status</description>
              <name>TXEIS</name>
            </field>
          </fields>
          <name>ISR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0034</addressOffset>
          <description>Raw interrupt status</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <description>Multi-master contention raw interrupt status</description>
              <name>MSTIR</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <description>Receive FIFO full raw interrupt status</description>
              <name>RXFIR</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <description>Receive FIFO overflow raw interrupt status</description>
              <name>RXOIR</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <description>Receive FIFO underflow raw interrupt status</description>
              <name>RXUIR</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>Transmit FIFO overflow raw interrupt status</description>
              <name>TXOIR</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Transmit FIFO empty raw interrupt status</description>
              <name>TXEIR</name>
            </field>
          </fields>
          <name>RISR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0038</addressOffset>
          <description>TX FIFO overflow interrupt clear</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Clear-on-read transmit FIFO overflow interrupt</description>
              <name>TXOICR</name>
            </field>
          </fields>
          <name>TXOICR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x003c</addressOffset>
          <description>RX FIFO overflow interrupt clear</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Clear-on-read receive FIFO overflow interrupt</description>
              <name>RXOICR</name>
            </field>
          </fields>
          <name>RXOICR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0040</addressOffset>
          <description>RX FIFO underflow interrupt clear</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Clear-on-read receive FIFO underflow interrupt</description>
              <name>RXUICR</name>
            </field>
          </fields>
          <name>RXUICR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0044</addressOffset>
          <description>Multi-master interrupt clear</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Clear-on-read multi-master contention interrupt</description>
              <name>MSTICR</name>
            </field>
          </fields>
          <name>MSTICR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0048</addressOffset>
          <description>Interrupt clear</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Clear-on-read all active interrupts</description>
              <name>ICR</name>
            </field>
          </fields>
          <name>ICR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x004c</addressOffset>
          <description>DMA control</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Transmit DMA enable</description>
              <name>TDMAE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Receive DMA enable</description>
              <name>RDMAE</name>
            </field>
          </fields>
          <name>DMACR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0050</addressOffset>
          <description>DMA TX data level</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Transmit data watermark level</description>
              <name>DMATDL</name>
            </field>
          </fields>
          <name>DMATDLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0054</addressOffset>
          <description>DMA RX data level</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Receive data watermark level (DMARDLR+1)</description>
              <name>DMARDL</name>
            </field>
          </fields>
          <name>DMARDLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
