qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
        <register>
          <addressOffset>0x0058</addressOffset>
          <description>Identification register</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[31:0]</bitRange>
              <description>Peripheral dentification code</description>
              <name>IDCODE</name>
            </field>
          </fields>
          <name>IDR</name>
          <resetValue>0x51535049</resetValue>
        </register>
        <register>
          <addressOffset>0x005c</addressOffset>
          <description>Version ID</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[31:0]</bitRange>
              <description>SNPS component version (format X.YY)</description>
              <name>SSI_COMP_VERSION</name>
            </field>
          </fields>
          <name>SSI_VERSION_ID</name>
          <resetValue>0x3430312a</resetValue>
        </register>
        <register>
          <addressOffset>0x0060</addressOffset>
          <description>Data Register 0 (of 36)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:0]</bitRange>
              <description>First data register of 36</description>
              <name>DR</name>
            </field>
          </fields>
          <name>DR0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00f0</addressOffset>
          <description>RX sample delay</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>RXD sample delay (in SCLK cycles)</description>
              <name>RSD</name>
            </field>
          </fields>
          <name>RX_SAMPLE_DLY</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00f4</addressOffset>
          <description>SPI control</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:24]</bitRange>
              <description>SPI Command to send in XIP mode (INST_L = 8-bit) or to append to Address (INST_L = 0-bit)</description>
              <name>XIP_CMD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <description>Read data strobe enable</description>
              <name>SPI_RXDS_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Instruction DDR transfer enable</description>
              <name>INST_DDR_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>SPI DDR transfer enable</description>
              <name>SPI_DDR_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:11]</bitRange>
              <description>Wait cycles between control frame transmit and data reception (in SCLK cycles)</description>
              <name>WAIT_CYCLES</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:8]</bitRange>
              <description>Instruction length (0/4/8/16b)</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>No instruction</description>
                  <name>NONE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>4-bit instruction</description>
                  <name>4B</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>8-bit instruction</description>
                  <name>8B</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>16-bit instruction</description>
                  <name>16B</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>INST_L</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:2]</bitRange>
              <description>Address length (0b-60b in 4b increments)</description>
              <name>ADDR_L</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:0]</bitRange>
              <description>Address and instruction transfer format</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Command and address both in standard SPI frame format</description>
                  <name>1C1A</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Command in standard SPI format, address in format specified by FRF</description>
                  <name>1C2A</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Command and address both in format specified by FRF (e.g. Dual-SPI)</description>
                  <name>2C2A</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>TRANS_TYPE</name>
            </field>
          </fields>
          <name>SPI_CTRLR0</name>
          <resetValue>0x03000000</resetValue>
        </register>
        <register>
          <addressOffset>0x00f8</addressOffset>
          <description>TX drive edge</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>TXD drive edge</description>
              <name>TDE</name>
            </field>
          </fields>
          <name>TXD_DRIVE_EDGE</name>
          <resetValue>0x00000000</resetValue>
        </register>
