qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
        <register>
          <addressOffset>0x003c</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Selects the clock source glitchlessly, can be changed on-the-fly</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_clk_sys_aux</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>SRC</name>
            </field>
          </fields>
          <name>CLK_SYS_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0040</addressOffset>
          <description>Clock divisor, can be changed on-the-fly</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:8]</bitRange>
              <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Fractional component of the divisor</description>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CLK_SYS_DIV</name>
          <resetValue>0x00000100</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0044</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            The glitchless multiplexer does not switch instantaneously (to avoid glitches), so software should poll this register to wait for the switch to complete. This register contains one decoded bit for each of the clock sources enumerated in the CTRL SRC field. At most one of these bits will be set at any time, indicating that clock is currently present at the output of the glitchless mux. Whilst switching is in progress, this register may briefly show all-0s.</description>
          <name>CLK_SYS_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x0048</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Starts and stops the clock generator cleanly</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Asynchronously kills the clock generator</description>
              <name>KILL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
          </fields>
          <name>CLK_PERI_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0050</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
          <name>CLK_PERI_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x0054</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock\n
                This can be done at any time</description>
              <name>NUDGE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <description>This delays the enable signal by up to 3 cycles of the input clock\n
                This must be set before the clock is enabled to have any effect</description>
              <name>PHASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Starts and stops the clock generator cleanly</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Asynchronously kills the clock generator</description>
              <name>KILL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
          </fields>
          <name>CLK_USB_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0058</addressOffset>
          <description>Clock divisor, can be changed on-the-fly</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[9:8]</bitRange>
              <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
              <name>INT</name>
            </field>
          </fields>
          <name>CLK_USB_DIV</name>
          <resetValue>0x00000100</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x005c</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
          <name>CLK_USB_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x0060</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock\n
                This can be done at any time</description>
              <name>NUDGE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <description>This delays the enable signal by up to 3 cycles of the input clock\n
                This must be set before the clock is enabled to have any effect</description>
              <name>PHASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Starts and stops the clock generator cleanly</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Asynchronously kills the clock generator</description>
              <name>KILL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
          </fields>
          <name>CLK_ADC_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0064</addressOffset>
          <description>Clock divisor, can be changed on-the-fly</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[9:8]</bitRange>
              <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
              <name>INT</name>
            </field>
          </fields>
          <name>CLK_ADC_DIV</name>
          <resetValue>0x00000100</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0068</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
          <name>CLK_ADC_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x006c</addressOffset>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock\n
                This can be done at any time</description>
              <name>NUDGE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:16]</bitRange>
              <description>This delays the enable signal by up to 3 cycles of the input clock\n
                This must be set before the clock is enabled to have any effect</description>
              <name>PHASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Starts and stops the clock generator cleanly</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Asynchronously kills the clock generator</description>
              <name>KILL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:5]</bitRange>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>AUXSRC</name>
            </field>
          </fields>
          <name>CLK_RTC_CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0070</addressOffset>
          <description>Clock divisor, can be changed on-the-fly</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:8]</bitRange>
              <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>Fractional component of the divisor</description>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CLK_RTC_DIV</name>
          <resetValue>0x00000100</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0074</addressOffset>
          <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).\n
            This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
          <name>CLK_RTC_SELECTED</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x0078</addressOffset>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>For clearing the resus after the fault that triggered it has been corrected</description>
              <name>CLEAR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>Force a resus, for test purposes only</description>
              <name>FRCE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <description>Enable resus</description>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <description>This is expressed as a number of clk_ref cycles\n
                and must be &gt;= 2x clk_ref_freq/min_clk_tst_freq</description>
              <name>TIMEOUT</name>
            </field>
          </fields>
          <name>CLK_SYS_RESUS_CTRL</name>
          <resetValue>0x000000ff</resetValue>
        </register>
        <register>
          <addressOffset>0x007c</addressOffset>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Clock has been resuscitated, correct the error then send ctrl_clear=1</description>
              <name>RESUSSED</name>
            </field>
          </fields>
          <name>CLK_SYS_RESUS_STATUS</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0080</addressOffset>
          <description>Reference clock frequency in kHz</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[19:0]</bitRange>
              <name>FC0_REF_KHZ</name>
            </field>
          </fields>
          <name>FC0_REF_KHZ</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0084</addressOffset>
          <description>Minimum pass frequency in kHz. This is optional. Set to 0 if you are not using the pass/fail flags</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[24:0]</bitRange>
              <name>FC0_MIN_KHZ</name>
            </field>
          </fields>
          <name>FC0_MIN_KHZ</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0088</addressOffset>
          <description>Maximum pass frequency in kHz. This is optional. Set to 0x1ffffff if you are not using the pass/fail flags</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[24:0]</bitRange>
              <name>FC0_MAX_KHZ</name>
            </field>
          </fields>
          <name>FC0_MAX_KHZ</name>
          <resetValue>0x01ffffff</resetValue>
        </register>
        <register>
          <addressOffset>0x008c</addressOffset>
          <description>Delays the start of frequency counting to allow the mux to settle\n
            Delay is measured in multiples of the reference clock period</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[2:0]</bitRange>
              <name>FC0_DELAY</name>
            </field>
          </fields>
          <name>FC0_DELAY</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <addressOffset>0x0090</addressOffset>
          <description>The test interval is 0.98us * 2**interval, but let's call it 1us * 2**interval\n
            The default gives a test interval of 250us</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <name>FC0_INTERVAL</name>
            </field>
          </fields>
          <name>FC0_INTERVAL</name>
          <resetValue>0x00000008</resetValue>
        </register>
