qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x4001c000</baseAddress>
      <name>PADS_BANK0</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>Voltage select. Per bank control</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Set voltage to 3.3V (DVDD &gt;= 2V5)</description>
                  <name>3v3</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Set voltage to 1.8V (DVDD &lt;= 1V8)</description>
                  <name>1v8</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>VOLTAGE_SELECT</name>
            </field>
          </fields>
          <name>VOLTAGE_SELECT</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO0</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0008</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO1</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x000c</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO2</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0010</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO3</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0014</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO4</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0018</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO5</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x001c</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO6</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0020</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO7</name>
          <resetValue>0x00000056</resetValue>
        </register>
        <register>
          <addressOffset>0x0024</addressOffset>
          <description>Pad control register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <name>OD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Input enable</description>
              <name>IE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <description>Drive strength.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DRIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Pull up enable</description>
              <name>PUE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Pull down enable</description>
              <name>PDE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Enable schmitt trigger</description>
              <name>SCHMITT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <name>SLEWFAST</name>
            </field>
          </fields>
          <name>GPIO8</name>
          <resetValue>0x00000056</resetValue>
        </register>
