qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x40024000</baseAddress>
      <description>Controls the crystal oscillator</description>
      <name>XOSC</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>Crystal Oscillator Control</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:12]</bitRange>
              <description>On power-up this field is initialised to DISABLE and the chip runs from the ROSC.\n
                If the chip has subsequently been programmed to run from the XOSC then setting this field to DISABLE may lock-up the chip. If this is a concern then run the clk_ref from the ROSC and enable the clk_sys RESUS feature.\n
                The 12-bit code is intended to give some protection against accidental writes. An invalid setting will enable the oscillator.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>3358</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>4011</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>ENABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:0]</bitRange>
              <description>Frequency range. This resets to 0xAA0 and cannot be changed.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_15MHZ</name>
                  <value>2720</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_1</name>
                  <value>2721</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_2</name>
                  <value>2722</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_3</name>
                  <value>2723</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>FREQ_RANGE</name>
            </field>
          </fields>
          <name>CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>Crystal Oscillator Status</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[31:31]</bitRange>
              <description>Oscillator is running and stable</description>
              <name>STABLE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[24:24]</bitRange>
              <description>An invalid value has been written to CTRL_ENABLE or CTRL_FREQ_RANGE or DORMANT</description>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>BADWRITE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <description>Oscillator is enabled but not necessarily running and stable, resets to 0</description>
              <name>ENABLED</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:0]</bitRange>
              <description>The current frequency range setting, always reads 0</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_15MHZ</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_3</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>FREQ_RANGE</name>
            </field>
          </fields>
          <name>STATUS</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0008</addressOffset>
          <description>Crystal Oscillator pause control\n
            This is used to save power by pausing the XOSC\n
            On power-up this field is initialised to WAKE\n
            An invalid write will also select WAKE\n
            WARNING: stop the PLLs before selecting dormant mode\n
            WARNING: setup the irq before selecting dormant mode</description>
          <name>DORMANT</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x000c</addressOffset>
          <description>Controls the startup delay</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[20:20]</bitRange>
              <description>Multiplies the startup_delay by 4. This is of little value to the user given that the delay can be programmed directly.</description>
              <name>X4</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:0]</bitRange>
              <description>in multiples of 256*xtal_period. The reset value of 0xc4 corresponds to approx 50 000 cycles.</description>
              <name>DELAY</name>
            </field>
          </fields>
          <name>STARTUP</name>
          <resetValue>0x000000c4</resetValue>
        </register>
        <register>
          <addressOffset>0x001c</addressOffset>
          <description>A down counter running at the xosc frequency which counts to zero and stops.\n
            To start the counter write a non-zero value.\n
            Can be used for short software pauses when setting up time sensitive hardware.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:0]</bitRange>
              <name>COUNT</name>
            </field>
          </fields>
          <name>COUNT</name>
          <resetValue>0x00000000</resetValue>
        </register>
