qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
      </registers>
      <size>32</size>
      <version>2</version>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x40050000</baseAddress>
      <description>Simple PWM</description>
      <interrupt>
        <name>PWM_IRQ_WRAP</name>
        <value>4</value>
      </interrupt>
      <name>PWM</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>Control and status register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Advance the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running\n
                at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>PH_ADV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Retard the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>PH_RET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Free-running counting at rate dictated by fractional divider</description>
                  <name>div</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Fractional divider operation is gated by the PWM B pin.</description>
                  <name>level</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Counter advances with each rising edge of the PWM B pin.</description>
                  <name>rise</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Counter advances with each falling edge of the PWM B pin.</description>
                  <name>fall</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DIVMODE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Invert output B</description>
              <name>B_INV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Invert output A</description>
              <name>A_INV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
              <name>PH_CORRECT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Enable the PWM channel.</description>
              <name>EN</name>
            </field>
          </fields>
          <name>CH0_CSR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>INT and FRAC form a fixed-point fractional number.\n
            Counting rate is system clock frequency divided by this number.\n
            Fractional division uses simple 1st-order sigma-delta.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[11:4]</bitRange>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CH0_DIV</name>
          <resetValue>0x00000010</resetValue>
        </register>
        <register>
          <addressOffset>0x0008</addressOffset>
          <description>Direct access to the PWM counter</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>CH0_CTR</name>
            </field>
          </fields>
          <name>CH0_CTR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x000c</addressOffset>
          <description>Counter compare values</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:16]</bitRange>
              <name>B</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>A</name>
            </field>
          </fields>
          <name>CH0_CC</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0010</addressOffset>
          <description>Counter wrap value</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>CH0_TOP</name>
            </field>
          </fields>
          <name>CH0_TOP</name>
          <resetValue>0x0000ffff</resetValue>
        </register>
        <register>
          <addressOffset>0x0014</addressOffset>
          <description>Control and status register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Advance the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running\n
                at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>PH_ADV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Retard the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>PH_RET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Free-running counting at rate dictated by fractional divider</description>
                  <name>div</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Fractional divider operation is gated by the PWM B pin.</description>
                  <name>level</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Counter advances with each rising edge of the PWM B pin.</description>
                  <name>rise</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Counter advances with each falling edge of the PWM B pin.</description>
                  <name>fall</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DIVMODE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Invert output B</description>
              <name>B_INV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Invert output A</description>
              <name>A_INV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
              <name>PH_CORRECT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Enable the PWM channel.</description>
              <name>EN</name>
            </field>
          </fields>
          <name>CH1_CSR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0018</addressOffset>
          <description>INT and FRAC form a fixed-point fractional number.\n
            Counting rate is system clock frequency divided by this number.\n
            Fractional division uses simple 1st-order sigma-delta.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[11:4]</bitRange>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CH1_DIV</name>
          <resetValue>0x00000010</resetValue>
        </register>
        <register>
          <addressOffset>0x001c</addressOffset>
          <description>Direct access to the PWM counter</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>CH1_CTR</name>
            </field>
          </fields>
          <name>CH1_CTR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0020</addressOffset>
          <description>Counter compare values</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:16]</bitRange>
              <name>B</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>A</name>
            </field>
          </fields>
          <name>CH1_CC</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0024</addressOffset>
          <description>Counter wrap value</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>CH1_TOP</name>
            </field>
          </fields>
          <name>CH1_TOP</name>
          <resetValue>0x0000ffff</resetValue>
        </register>
        <register>
          <addressOffset>0x0028</addressOffset>
          <description>Control and status register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Advance the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running\n
                at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>PH_ADV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Retard the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>PH_RET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Free-running counting at rate dictated by fractional divider</description>
                  <name>div</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Fractional divider operation is gated by the PWM B pin.</description>
                  <name>level</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Counter advances with each rising edge of the PWM B pin.</description>
                  <name>rise</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Counter advances with each falling edge of the PWM B pin.</description>
                  <name>fall</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DIVMODE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Invert output B</description>
              <name>B_INV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Invert output A</description>
              <name>A_INV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
              <name>PH_CORRECT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Enable the PWM channel.</description>
              <name>EN</name>
            </field>
          </fields>
          <name>CH2_CSR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x002c</addressOffset>
          <description>INT and FRAC form a fixed-point fractional number.\n
            Counting rate is system clock frequency divided by this number.\n
            Fractional division uses simple 1st-order sigma-delta.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[11:4]</bitRange>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CH2_DIV</name>
          <resetValue>0x00000010</resetValue>
        </register>
        <register>
          <addressOffset>0x0030</addressOffset>
          <description>Direct access to the PWM counter</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>CH2_CTR</name>
            </field>
          </fields>
          <name>CH2_CTR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0034</addressOffset>
          <description>Counter compare values</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:16]</bitRange>
              <name>B</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>A</name>
            </field>
          </fields>
          <name>CH2_CC</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0038</addressOffset>
          <description>Counter wrap value</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>CH2_TOP</name>
            </field>
          </fields>
          <name>CH2_TOP</name>
          <resetValue>0x0000ffff</resetValue>
        </register>
        <register>
          <addressOffset>0x003c</addressOffset>
          <description>Control and status register</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Advance the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running\n
                at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>PH_ADV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Retard the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>PH_RET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <description>Free-running counting at rate dictated by fractional divider</description>
                  <name>div</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Fractional divider operation is gated by the PWM B pin.</description>
                  <name>level</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Counter advances with each rising edge of the PWM B pin.</description>
                  <name>rise</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>Counter advances with each falling edge of the PWM B pin.</description>
                  <name>fall</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>DIVMODE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Invert output B</description>
              <name>B_INV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Invert output A</description>
              <name>A_INV</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
              <name>PH_CORRECT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Enable the PWM channel.</description>
              <name>EN</name>
            </field>
          </fields>
          <name>CH3_CSR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0040</addressOffset>
          <description>INT and FRAC form a fixed-point fractional number.\n
            Counting rate is system clock frequency divided by this number.\n
            Fractional division uses simple 1st-order sigma-delta.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[11:4]</bitRange>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <name>FRAC</name>
            </field>
          </fields>
          <name>CH3_DIV</name>
          <resetValue>0x00000010</resetValue>
        </register>
        <register>
          <addressOffset>0x0044</addressOffset>
          <description>Direct access to the PWM counter</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>CH3_CTR</name>
            </field>
          </fields>
          <name>CH3_CTR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0048</addressOffset>
          <description>Counter compare values</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:16]</bitRange>
              <name>B</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>A</name>
            </field>
          </fields>
          <name>CH3_CC</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x004c</addressOffset>
          <description>Counter wrap value</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>CH3_TOP</name>
            </field>
          </fields>
          <name>CH3_TOP</name>
          <resetValue>0x0000ffff</resetValue>
        </register>
