qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0x4005c000</baseAddress>
      <description>Register block to control RTC</description>
      <interrupt>
        <name>RTC_IRQ</name>
        <value>25</value>
      </interrupt>
      <name>RTC</name>
      <registers>
        <register>
          <addressOffset>0x0000</addressOffset>
          <description>Divider minus 1 for the 1 second counter. Safe to change the value when RTC is not enabled.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>CLKDIV_M1</name>
            </field>
          </fields>
          <name>CLKDIV_M1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>RTC setup register 0</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[23:12]</bitRange>
              <description>Year</description>
              <name>YEAR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:8]</bitRange>
              <description>Month (1..12)</description>
              <name>MONTH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>Day of the month (1..31)</description>
              <name>DAY</name>
            </field>
          </fields>
          <name>SETUP_0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0008</addressOffset>
          <description>RTC setup register 1</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[26:24]</bitRange>
              <description>Day of the week: 1-Monday...0-Sunday ISO 8601 mod 7</description>
              <name>DOTW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[20:16]</bitRange>
              <description>Hours</description>
              <name>HOUR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:8]</bitRange>
              <description>Minutes</description>
              <name>MIN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:0]</bitRange>
              <description>Seconds</description>
              <name>SEC</name>
            </field>
          </fields>
          <name>SETUP_1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x000c</addressOffset>
          <description>RTC Control and status</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <description>If set, leapyear is forced off.\n
                Useful for years divisible by 100 but not by 400</description>
              <name>FORCE_NOTLEAPYEAR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>Load RTC</description>
              <modifiedWriteValues>clear</modifiedWriteValues>
              <name>LOAD</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>RTC enabled (running)</description>
              <name>RTC_ACTIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Enable RTC</description>
              <name>RTC_ENABLE</name>
            </field>
          </fields>
          <name>CTRL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0010</addressOffset>
          <description>Interrupt setup register 0</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[29:29]</bitRange>
              <name>MATCH_ACTIVE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>Global match enable. Don't change any other value while this one is enabled</description>
              <name>MATCH_ENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[26:26]</bitRange>
              <description>Enable year matching</description>
              <name>YEAR_ENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:25]</bitRange>
              <description>Enable month matching</description>
              <name>MONTH_ENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[24:24]</bitRange>
              <description>Enable day matching</description>
              <name>DAY_ENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[23:12]</bitRange>
              <description>Year</description>
              <name>YEAR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:8]</bitRange>
              <description>Month (1..12)</description>
              <name>MONTH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>Day of the month (1..31)</description>
              <name>DAY</name>
            </field>
          </fields>
          <name>IRQ_SETUP_0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0014</addressOffset>
          <description>Interrupt setup register 1</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>Enable day of the week matching</description>
              <name>DOTW_ENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>Enable hour matching</description>
              <name>HOUR_ENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>Enable minute matching</description>
              <name>MIN_ENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:28]</bitRange>
              <description>Enable second matching</description>
              <name>SEC_ENA</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[26:24]</bitRange>
              <description>Day of the week</description>
              <name>DOTW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[20:16]</bitRange>
              <description>Hours</description>
              <name>HOUR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:8]</bitRange>
              <description>Minutes</description>
              <name>MIN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:0]</bitRange>
              <description>Seconds</description>
              <name>SEC</name>
            </field>
          </fields>
          <name>IRQ_SETUP_1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0018</addressOffset>
          <description>RTC register 1.</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[23:12]</bitRange>
              <description>Year</description>
              <name>YEAR</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[11:8]</bitRange>
              <description>Month (1..12)</description>
              <name>MONTH</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:0]</bitRange>
              <description>Day of the month (1..31)</description>
              <name>DAY</name>
            </field>
          </fields>
          <name>RTC_1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x001c</addressOffset>
          <description>RTC register 0\n
            Read this before RTC 1!</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[26:24]</bitRange>
              <description>Day of the week</description>
              <name>DOTW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[20:16]</bitRange>
              <description>Hours</description>
              <name>HOUR</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:8]</bitRange>
              <description>Minutes</description>
              <name>MIN</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:0]</bitRange>
              <description>Seconds</description>
              <name>SEC</name>
            </field>
          </fields>
          <name>RTC_0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0020</addressOffset>
          <description>Raw Interrupts</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>RTC</name>
            </field>
          </fields>
          <name>INTR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0024</addressOffset>
          <description>Interrupt Enable</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <name>RTC</name>
            </field>
          </fields>
          <name>INTE</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0028</addressOffset>
          <description>Interrupt Force</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <name>RTC</name>
            </field>
          </fields>
          <name>INTF</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x002c</addressOffset>
          <description>Interrupt status after masking &amp; forcing</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>RTC</name>
            </field>
          </fields>
          <name>INTS</name>
          <resetValue>0x00000000</resetValue>
        </register>
