qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
        <register>
          <addressOffset>0x007c</addressOffset>
          <description>This register allows for direct control of the USB phy. Use in conjunction with usbphy_direct_override register to enable each override bit.</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[22:22]</bitRange>
              <description>DM over voltage</description>
              <name>DM_OVV</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[21:21]</bitRange>
              <description>DP over voltage</description>
              <name>DP_OVV</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[20:20]</bitRange>
              <description>DM overcurrent</description>
              <name>DM_OVCN</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[19:19]</bitRange>
              <description>DP overcurrent</description>
              <name>DP_OVCN</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[18:18]</bitRange>
              <description>DPM pin state</description>
              <name>RX_DM</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <description>DPP pin state</description>
              <name>RX_DP</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[16:16]</bitRange>
              <description>Differential RX</description>
              <name>RX_DD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <description>TX_DIFFMODE=0: Single ended mode\n
                TX_DIFFMODE=1: Differential drive mode (TX_DM, TX_DM_OE ignored)</description>
              <name>TX_DIFFMODE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <description>TX_FSSLEW=0: Low speed slew rate\n
                TX_FSSLEW=1: Full speed slew rate</description>
              <name>TX_FSSLEW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:13]</bitRange>
              <description>TX power down override (if override enable is set). 1 = powered down.</description>
              <name>TX_PD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>RX power down override (if override enable is set). 1 = powered down.</description>
              <name>RX_PD</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Output data. TX_DIFFMODE=1, Ignored\n
                TX_DIFFMODE=0, Drives DPM only. TX_DM_OE=1 to enable drive. DPM=TX_DM</description>
              <name>TX_DM</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Output data. If TX_DIFFMODE=1, Drives DPP/DPM diff pair. TX_DP_OE=1 to enable drive. DPP=TX_DP, DPM=~TX_DP\n
                If TX_DIFFMODE=0, Drives DPP only. TX_DP_OE=1 to enable drive. DPP=TX_DP</description>
              <name>TX_DP</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <description>Output enable. If TX_DIFFMODE=1, Ignored.\n
                If TX_DIFFMODE=0, OE for DPM only. 0 - DPM in Hi-Z state; 1 - DPM driving</description>
              <name>TX_DM_OE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <description>Output enable. If TX_DIFFMODE=1, OE for DPP/DPM diff pair. 0 - DPP/DPM in Hi-Z state; 1 - DPP/DPM driving\n
                If TX_DIFFMODE=0, OE for DPP only. 0 - DPP in Hi-Z state; 1 - DPP driving</description>
              <name>TX_DP_OE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>DM pull down enable</description>
              <name>DM_PULLDN_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <description>DM pull up enable</description>
              <name>DM_PULLUP_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>Enable the second DM pull up resistor. 0 - Pull = Rpu2; 1 - Pull = Rpu1 + Rpu2</description>
              <name>DM_PULLUP_HISEL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>DP pull down enable</description>
              <name>DP_PULLDN_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>DP pull up enable</description>
              <name>DP_PULLUP_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Enable the second DP pull up resistor. 0 - Pull = Rpu2; 1 - Pull = Rpu1 + Rpu2</description>
              <name>DP_PULLUP_HISEL</name>
            </field>
          </fields>
          <name>USBPHY_DIRECT</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0080</addressOffset>
          <description>Override enable for each control in usbphy_direct</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <name>TX_DIFFMODE_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <name>DM_PULLUP_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <name>TX_FSSLEW_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <name>TX_PD_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <name>RX_PD_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <name>TX_DM_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <name>TX_DP_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <name>TX_DM_OE_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <name>TX_DP_OE_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <name>DM_PULLDN_EN_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <name>DP_PULLDN_EN_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <name>DP_PULLUP_EN_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <name>DM_PULLUP_HISEL_OVERRIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <name>DP_PULLUP_HISEL_OVERRIDE_EN</name>
            </field>
          </fields>
          <name>USBPHY_DIRECT_OVERRIDE</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0084</addressOffset>
          <description>Used to adjust trim values of USB phy pull down resistors.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[12:8]</bitRange>
              <description>Value to drive to USB PHY\n
                DM pulldown resistor trim control\n
                Experimental data suggests that the reset value will work, but this register allows adjustment if required</description>
              <name>DM_PULLDN_TRIM</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>Value to drive to USB PHY\n
                DP pulldown resistor trim control\n
                Experimental data suggests that the reset value will work, but this register allows adjustment if required</description>
              <name>DP_PULLDN_TRIM</name>
            </field>
          </fields>
          <name>USBPHY_TRIM</name>
          <resetValue>0x00001f1f</resetValue>
        </register>
        <register>
          <addressOffset>0x008c</addressOffset>
          <description>Raw Interrupts</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[19:19]</bitRange>
              <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
              <name>EP_STALL_NAK</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[18:18]</bitRange>
              <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
              <name>ABORT_DONE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
              <name>DEV_SOF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[16:16]</bitRange>
              <description>Device. Source: SIE_STATUS.SETUP_REC</description>
              <name>SETUP_REQ</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[15:15]</bitRange>
              <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
              <name>DEV_RESUME_FROM_HOST</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[14:14]</bitRange>
              <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
              <name>DEV_SUSPEND</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
              <name>DEV_CONN_DIS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <description>Source: SIE_STATUS.BUS_RESET</description>
              <name>BUS_RESET</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[11:11]</bitRange>
              <description>Source: SIE_STATUS.VBUS_DETECTED</description>
              <name>VBUS_DETECT</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[10:10]</bitRange>
              <description>Source: SIE_STATUS.STALL_REC</description>
              <name>STALL</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <description>Source: SIE_STATUS.CRC_ERROR</description>
              <name>ERROR_CRC</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
              <name>ERROR_BIT_STUFF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[7:7]</bitRange>
              <description>Source: SIE_STATUS.RX_OVERFLOW</description>
              <name>ERROR_RX_OVERFLOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[6:6]</bitRange>
              <description>Source: SIE_STATUS.RX_TIMEOUT</description>
              <name>ERROR_RX_TIMEOUT</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
              <name>ERROR_DATA_SEQ</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
              <name>BUFF_STATUS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
              <name>TRANS_COMPLETE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
              <name>HOST_SOF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
              <name>HOST_RESUME</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
              <name>HOST_CONN_DIS</name>
            </field>
          </fields>
          <name>INTR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0090</addressOffset>
          <description>Interrupt Enable</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[19:19]</bitRange>
              <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
              <name>EP_STALL_NAK</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
              <name>ABORT_DONE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
              <name>DEV_SOF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Device. Source: SIE_STATUS.SETUP_REC</description>
              <name>SETUP_REQ</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
              <name>DEV_RESUME_FROM_HOST</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
              <name>DEV_SUSPEND</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:13]</bitRange>
              <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
              <name>DEV_CONN_DIS</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>Source: SIE_STATUS.BUS_RESET</description>
              <name>BUS_RESET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Source: SIE_STATUS.VBUS_DETECTED</description>
              <name>VBUS_DETECT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Source: SIE_STATUS.STALL_REC</description>
              <name>STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <description>Source: SIE_STATUS.CRC_ERROR</description>
              <name>ERROR_CRC</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
              <name>ERROR_BIT_STUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Source: SIE_STATUS.RX_OVERFLOW</description>
              <name>ERROR_RX_OVERFLOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Source: SIE_STATUS.RX_TIMEOUT</description>
              <name>ERROR_RX_TIMEOUT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
              <name>ERROR_DATA_SEQ</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
              <name>BUFF_STATUS</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
              <name>TRANS_COMPLETE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
              <name>HOST_SOF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
              <name>HOST_RESUME</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
              <name>HOST_CONN_DIS</name>
            </field>
          </fields>
          <name>INTE</name>
          <resetValue>0x00000000</resetValue>
        </register>
