qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
        <register>
          <addressOffset>0x0094</addressOffset>
          <description>Interrupt Force</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[19:19]</bitRange>
              <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
              <name>EP_STALL_NAK</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
              <name>ABORT_DONE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
              <name>DEV_SOF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Device. Source: SIE_STATUS.SETUP_REC</description>
              <name>SETUP_REQ</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:15]</bitRange>
              <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
              <name>DEV_RESUME_FROM_HOST</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:14]</bitRange>
              <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
              <name>DEV_SUSPEND</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[13:13]</bitRange>
              <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
              <name>DEV_CONN_DIS</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[12:12]</bitRange>
              <description>Source: SIE_STATUS.BUS_RESET</description>
              <name>BUS_RESET</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <description>Source: SIE_STATUS.VBUS_DETECTED</description>
              <name>VBUS_DETECT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <description>Source: SIE_STATUS.STALL_REC</description>
              <name>STALL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <description>Source: SIE_STATUS.CRC_ERROR</description>
              <name>ERROR_CRC</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
              <name>ERROR_BIT_STUFF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <description>Source: SIE_STATUS.RX_OVERFLOW</description>
              <name>ERROR_RX_OVERFLOW</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <description>Source: SIE_STATUS.RX_TIMEOUT</description>
              <name>ERROR_RX_TIMEOUT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
              <name>ERROR_DATA_SEQ</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
              <name>BUFF_STATUS</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
              <name>TRANS_COMPLETE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
              <name>HOST_SOF</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
              <name>HOST_RESUME</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
              <name>HOST_CONN_DIS</name>
            </field>
          </fields>
          <name>INTF</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0098</addressOffset>
          <description>Interrupt status after masking &amp; forcing</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[19:19]</bitRange>
              <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
              <name>EP_STALL_NAK</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[18:18]</bitRange>
              <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
              <name>ABORT_DONE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[17:17]</bitRange>
              <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
              <name>DEV_SOF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[16:16]</bitRange>
              <description>Device. Source: SIE_STATUS.SETUP_REC</description>
              <name>SETUP_REQ</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[15:15]</bitRange>
              <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
              <name>DEV_RESUME_FROM_HOST</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[14:14]</bitRange>
              <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
              <name>DEV_SUSPEND</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[13:13]</bitRange>
              <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
              <name>DEV_CONN_DIS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[12:12]</bitRange>
              <description>Source: SIE_STATUS.BUS_RESET</description>
              <name>BUS_RESET</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[11:11]</bitRange>
              <description>Source: SIE_STATUS.VBUS_DETECTED</description>
              <name>VBUS_DETECT</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[10:10]</bitRange>
              <description>Source: SIE_STATUS.STALL_REC</description>
              <name>STALL</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <description>Source: SIE_STATUS.CRC_ERROR</description>
              <name>ERROR_CRC</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
              <name>ERROR_BIT_STUFF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[7:7]</bitRange>
              <description>Source: SIE_STATUS.RX_OVERFLOW</description>
              <name>ERROR_RX_OVERFLOW</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[6:6]</bitRange>
              <description>Source: SIE_STATUS.RX_TIMEOUT</description>
              <name>ERROR_RX_TIMEOUT</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
              <name>ERROR_DATA_SEQ</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
              <name>BUFF_STATUS</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
              <name>TRANS_COMPLETE</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
              <name>HOST_SOF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
              <name>HOST_RESUME</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
              <name>HOST_CONN_DIS</name>
            </field>
          </fields>
          <name>INTS</name>
          <resetValue>0x00000000</resetValue>
        </register>
