qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
        <register>
          <addressOffset>0x010c</addressOffset>
          <description>State machine pin control</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:29]</bitRange>
              <description>The number of MSBs of the Delay/Side-set instruction field which are used for side-set. Inclusive of the enable bit, if present. Minimum of 0 (all delay bits, no side-set) and maximum of 5 (all side-set, no delay).</description>
              <name>SIDESET_COUNT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:26]</bitRange>
              <description>The number of pins asserted by a SET. In the range 0 to 5 inclusive.</description>
              <name>SET_COUNT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:20]</bitRange>
              <description>The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV PINS instruction. In the range 0 to 32 inclusive.</description>
              <name>OUT_COUNT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:15]</bitRange>
              <description>The pin which is mapped to the least-significant bit of a state machine's IN data bus. Higher-numbered pins are mapped to consecutively more-significant data bits, with a modulo of 32 applied to pin number.</description>
              <name>IN_BASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:10]</bitRange>
              <description>The lowest-numbered pin that will be affected by a side-set operation. The MSBs of an instruction's side-set/delay field (up to 5, determined by SIDESET_COUNT) are used for side-set data, with the remaining LSBs used for delay. The least-significant bit of the side-set portion is the bit written to this pin, with more-significant bits written to higher-numbered pins.</description>
              <name>SIDESET_BASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:5]</bitRange>
              <description>The lowest-numbered pin that will be affected by a SET PINS or SET PINDIRS instruction. The data written to this pin is the least-significant bit of the SET data.</description>
              <name>SET_BASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>The lowest-numbered pin that will be affected by an OUT PINS, OUT PINDIRS or MOV PINS instruction. The data written to this pin will always be the least-significant bit of the OUT or MOV data.</description>
              <name>OUT_BASE</name>
            </field>
          </fields>
          <name>SM2_PINCTRL</name>
          <resetValue>0x14000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0110</addressOffset>
          <description>Clock divisor register for state machine 3\n
            Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:16]</bitRange>
              <description>Effective frequency is sysclk/(int + frac/256).\n
                Value of 0 is interpreted as 65536. If INT is 0, FRAC must also be 0.</description>
              <name>INT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[15:8]</bitRange>
              <description>Fractional part of clock divisor</description>
              <name>FRAC</name>
            </field>
          </fields>
          <name>SM3_CLKDIV</name>
          <resetValue>0x00010000</resetValue>
        </register>
        <register>
          <addressOffset>0x0114</addressOffset>
          <description>Execution/behavioural settings for state machine 3</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[31:31]</bitRange>
              <description>If 1, an instruction written to SMx_INSTR is stalled, and latched by the state machine. Will clear to 0 once this instruction completes.</description>
              <name>EXEC_STALLED</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>If 1, the MSB of the Delay/Side-set instruction field is used as side-set enable, rather than a side-set data bit. This allows instructions to perform side-set optionally, rather than on every instruction, but the maximum possible side-set width is reduced from 5 to 4. Note that the value of PINCTRL_SIDESET_COUNT is inclusive of this enable bit.</description>
              <name>SIDE_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:29]</bitRange>
              <description>If 1, side-set data is asserted to pin directions, instead of pin values</description>
              <name>SIDE_PINDIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:24]</bitRange>
              <description>The GPIO number to use as condition for JMP PIN. Unaffected by input mapping.</description>
              <name>JMP_PIN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[23:19]</bitRange>
              <description>Which data bit to use for inline OUT enable</description>
              <name>OUT_EN_SEL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <description>If 1, use a bit of OUT data as an auxiliary write enable\n
                When used in conjunction with OUT_STICKY, writes with an enable of 0 will\n
                deassert the latest pin write. This can create useful masking/override behaviour\n
                due to the priority ordering of state machine pin writes (SM0 &lt; SM1 &lt; ...)</description>
              <name>INLINE_OUT_EN</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Continuously assert the most recent OUT/SET to the pins</description>
              <name>OUT_STICKY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:12]</bitRange>
              <description>After reaching this address, execution is wrapped to wrap_bottom.\n
                If the instruction is a jump, and the jump condition is true, the jump takes priority.</description>
              <name>WRAP_TOP</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[11:7]</bitRange>
              <description>After reaching wrap_top, execution is wrapped to this address.</description>
              <name>WRAP_BOTTOM</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <description>Comparison used for the MOV x, STATUS instruction.</description>
              <enumeratedValues>
                <enumeratedValue>
                  <description>All-ones if TX FIFO level &lt; N, otherwise all-zeroes</description>
                  <name>TXLEVEL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <description>All-ones if RX FIFO level &lt; N, otherwise all-zeroes</description>
                  <name>RXLEVEL</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <name>STATUS_SEL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:0]</bitRange>
              <description>Comparison level for the MOV x, STATUS instruction</description>
              <name>STATUS_N</name>
            </field>
          </fields>
          <name>SM3_EXECCTRL</name>
          <resetValue>0x0001f000</resetValue>
        </register>
        <register>
          <addressOffset>0x0118</addressOffset>
          <description>Control behaviour of the input/output shift registers for state machine 3</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:31]</bitRange>
              <description>When 1, RX FIFO steals the TX FIFO's storage, and becomes twice as deep.\n
                TX FIFO is disabled as a result (always reads as both full and empty).\n
                FIFOs are flushed when this bit is changed.</description>
              <name>FJOIN_RX</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[30:30]</bitRange>
              <description>When 1, TX FIFO steals the RX FIFO's storage, and becomes twice as deep.\n
                RX FIFO is disabled as a result (always reads as both full and empty).\n
                FIFOs are flushed when this bit is changed.</description>
              <name>FJOIN_TX</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[29:25]</bitRange>
              <description>Number of bits shifted out of OSR before autopull, or conditional pull (PULL IFEMPTY), will take place.\n
                Write 0 for value of 32.</description>
              <name>PULL_THRESH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[24:20]</bitRange>
              <description>Number of bits shifted into ISR before autopush, or conditional push (PUSH IFFULL), will take place.\n
                Write 0 for value of 32.</description>
              <name>PUSH_THRESH</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:19]</bitRange>
              <description>1 = shift out of output shift register to right. 0 = to left.</description>
              <name>OUT_SHIFTDIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[18:18]</bitRange>
              <description>1 = shift input shift register to right (data enters from left). 0 = to left.</description>
              <name>IN_SHIFTDIR</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[17:17]</bitRange>
              <description>Pull automatically when the output shift register is emptied, i.e. on or following an OUT instruction which causes the output shift counter to reach or exceed PULL_THRESH.</description>
              <name>AUTOPULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[16:16]</bitRange>
              <description>Push automatically when the input shift register is filled, i.e. on an IN instruction which causes the input shift counter to reach or exceed PUSH_THRESH.</description>
              <name>AUTOPUSH</name>
            </field>
          </fields>
          <name>SM3_SHIFTCTRL</name>
          <resetValue>0x000c0000</resetValue>
        </register>
        <register>
          <addressOffset>0x011c</addressOffset>
          <description>Current instruction address of state machine 3</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[4:0]</bitRange>
              <name>SM3_ADDR</name>
            </field>
          </fields>
          <name>SM3_ADDR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0120</addressOffset>
          <description>Read to see the instruction currently addressed by state machine 3's program counter\n
            Write to execute an instruction immediately (including jumps) and then resume execution.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[15:0]</bitRange>
              <name>SM3_INSTR</name>
            </field>
          </fields>
          <name>SM3_INSTR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0124</addressOffset>
          <description>State machine pin control</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[31:29]</bitRange>
              <description>The number of MSBs of the Delay/Side-set instruction field which are used for side-set. Inclusive of the enable bit, if present. Minimum of 0 (all delay bits, no side-set) and maximum of 5 (all side-set, no delay).</description>
              <name>SIDESET_COUNT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[28:26]</bitRange>
              <description>The number of pins asserted by a SET. In the range 0 to 5 inclusive.</description>
              <name>SET_COUNT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[25:20]</bitRange>
              <description>The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV PINS instruction. In the range 0 to 32 inclusive.</description>
              <name>OUT_COUNT</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[19:15]</bitRange>
              <description>The pin which is mapped to the least-significant bit of a state machine's IN data bus. Higher-numbered pins are mapped to consecutively more-significant data bits, with a modulo of 32 applied to pin number.</description>
              <name>IN_BASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[14:10]</bitRange>
              <description>The lowest-numbered pin that will be affected by a side-set operation. The MSBs of an instruction's side-set/delay field (up to 5, determined by SIDESET_COUNT) are used for side-set data, with the remaining LSBs used for delay. The least-significant bit of the side-set portion is the bit written to this pin, with more-significant bits written to higher-numbered pins.</description>
              <name>SIDESET_BASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:5]</bitRange>
              <description>The lowest-numbered pin that will be affected by a SET PINS or SET PINDIRS instruction. The data written to this pin is the least-significant bit of the SET data.</description>
              <name>SET_BASE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:0]</bitRange>
              <description>The lowest-numbered pin that will be affected by an OUT PINS, OUT PINDIRS or MOV PINS instruction. The data written to this pin will always be the least-significant bit of the OUT or MOV data.</description>
              <name>OUT_BASE</name>
            </field>
          </fields>
          <name>SM3_PINCTRL</name>
          <resetValue>0x14000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0128</addressOffset>
          <description>Raw Interrupts</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[11:11]</bitRange>
              <name>SM3</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[10:10]</bitRange>
              <name>SM2</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[9:9]</bitRange>
              <name>SM1</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[8:8]</bitRange>
              <name>SM0</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[7:7]</bitRange>
              <name>SM3_TXNFULL</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[6:6]</bitRange>
              <name>SM2_TXNFULL</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[5:5]</bitRange>
              <name>SM1_TXNFULL</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[4:4]</bitRange>
              <name>SM0_TXNFULL</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[3:3]</bitRange>
              <name>SM3_RXNEMPTY</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[2:2]</bitRange>
              <name>SM2_RXNEMPTY</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <name>SM1_RXNEMPTY</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <name>SM0_RXNEMPTY</name>
            </field>
          </fields>
          <name>INTR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x012c</addressOffset>
          <description>Interrupt Enable for irq0</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <name>SM3</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <name>SM2</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <name>SM1</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <name>SM0</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <name>SM3_TXNFULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <name>SM2_TXNFULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <name>SM1_TXNFULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <name>SM0_TXNFULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <name>SM3_RXNEMPTY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <name>SM2_RXNEMPTY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <name>SM1_RXNEMPTY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <name>SM0_RXNEMPTY</name>
            </field>
          </fields>
          <name>IRQ0_INTE</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0130</addressOffset>
          <description>Interrupt Force for irq0</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[11:11]</bitRange>
              <name>SM3</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[10:10]</bitRange>
              <name>SM2</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[9:9]</bitRange>
              <name>SM1</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[8:8]</bitRange>
              <name>SM0</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[7:7]</bitRange>
              <name>SM3_TXNFULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[6:6]</bitRange>
              <name>SM2_TXNFULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[5:5]</bitRange>
              <name>SM1_TXNFULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[4:4]</bitRange>
              <name>SM0_TXNFULL</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <name>SM3_RXNEMPTY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <name>SM2_RXNEMPTY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[1:1]</bitRange>
              <name>SM1_RXNEMPTY</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[0:0]</bitRange>
              <name>SM0_RXNEMPTY</name>
            </field>
          </fields>
          <name>IRQ0_INTF</name>
          <resetValue>0x00000000</resetValue>
        </register>
