qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
      </registers>
      <size>32</size>
      <version>1</version>
    </peripheral>
    <peripheral derivedFrom="PIO0">
      <baseAddress>0x50300000</baseAddress>
      <interrupt>
        <name>PIO1_IRQ_0</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>PIO1_IRQ_1</name>
        <value>10</value>
      </interrupt>
      <name>PIO1</name>
    </peripheral>
    <peripheral>
      <addressBlock>
        <offset>0</offset>
        <size>0x0200</size>
        <usage>registers</usage>
      </addressBlock>
      <baseAddress>0xd0000000</baseAddress>
      <description>Single-cycle IO block\n
        Provides core-local and inter-core hardware for the two processors, with single-cycle access.</description>
      <interrupt>
        <name>SIO_IRQ_PROC0</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>SIO_IRQ_PROC1</name>
        <value>16</value>
      </interrupt>
      <name>SIO</name>
      <registers>
        <register>
          <access>read-only</access>
          <addressOffset>0x0000</addressOffset>
          <description>Processor core identifier\n
            Value is 0 when read from processor core 0, and 1 when read from processor core 1.</description>
          <name>CPUID</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0004</addressOffset>
          <description>Input value for GPIO pins</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[29:0]</bitRange>
              <description>Input value for GPIO0...29</description>
              <name>GPIO_IN</name>
            </field>
          </fields>
          <name>GPIO_IN</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0008</addressOffset>
          <description>Input value for QSPI pins</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[5:0]</bitRange>
              <description>Input value on QSPI IO in order 0..5: SCLK, SSn, SD0, SD1, SD2, SD3</description>
              <name>GPIO_HI_IN</name>
            </field>
          </fields>
          <name>GPIO_HI_IN</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0010</addressOffset>
          <description>GPIO output value</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[29:0]</bitRange>
              <description>Set output level (1/0 -&gt; high/low) for GPIO0...29.\n
                Reading back gives the last value written, NOT the input value from the pins.\n
                If core 0 and core 1 both write to GPIO_OUT simultaneously (or to a SET/CLR/XOR alias),\n
                the result is as though the write from core 0 took place first,\n
                and the write from core 1 was then applied to that intermediate result.</description>
              <name>GPIO_OUT</name>
            </field>
          </fields>
          <name>GPIO_OUT</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0014</addressOffset>
          <description>GPIO output value set</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[29:0]</bitRange>
              <description>Perform an atomic bit-set on GPIO_OUT, i.e. `GPIO_OUT |= wdata`</description>
              <name>GPIO_OUT_SET</name>
            </field>
          </fields>
          <name>GPIO_OUT_SET</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0018</addressOffset>
          <description>GPIO output value clear</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[29:0]</bitRange>
              <description>Perform an atomic bit-clear on GPIO_OUT, i.e. `GPIO_OUT &amp;= ~wdata`</description>
              <name>GPIO_OUT_CLR</name>
            </field>
          </fields>
          <name>GPIO_OUT_CLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x001c</addressOffset>
          <description>GPIO output value XOR</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[29:0]</bitRange>
              <description>Perform an atomic bitwise XOR on GPIO_OUT, i.e. `GPIO_OUT ^= wdata`</description>
              <name>GPIO_OUT_XOR</name>
            </field>
          </fields>
          <name>GPIO_OUT_XOR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0020</addressOffset>
          <description>GPIO output enable</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[29:0]</bitRange>
              <description>Set output enable (1/0 -&gt; output/input) for GPIO0...29.\n
                Reading back gives the last value written.\n
                If core 0 and core 1 both write to GPIO_OE simultaneously (or to a SET/CLR/XOR alias),\n
                the result is as though the write from core 0 took place first,\n
                and the write from core 1 was then applied to that intermediate result.</description>
              <name>GPIO_OE</name>
            </field>
          </fields>
          <name>GPIO_OE</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0024</addressOffset>
          <description>GPIO output enable set</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[29:0]</bitRange>
              <description>Perform an atomic bit-set on GPIO_OE, i.e. `GPIO_OE |= wdata`</description>
              <name>GPIO_OE_SET</name>
            </field>
          </fields>
          <name>GPIO_OE_SET</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0028</addressOffset>
          <description>GPIO output enable clear</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[29:0]</bitRange>
              <description>Perform an atomic bit-clear on GPIO_OE, i.e. `GPIO_OE &amp;= ~wdata`</description>
              <name>GPIO_OE_CLR</name>
            </field>
          </fields>
          <name>GPIO_OE_CLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x002c</addressOffset>
          <description>GPIO output enable XOR</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[29:0]</bitRange>
              <description>Perform an atomic bitwise XOR on GPIO_OE, i.e. `GPIO_OE ^= wdata`</description>
              <name>GPIO_OE_XOR</name>
            </field>
          </fields>
          <name>GPIO_OE_XOR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0030</addressOffset>
          <description>QSPI output value</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[5:0]</bitRange>
              <description>Set output level (1/0 -&gt; high/low) for QSPI IO0...5.\n
                Reading back gives the last value written, NOT the input value from the pins.\n
                If core 0 and core 1 both write to GPIO_HI_OUT simultaneously (or to a SET/CLR/XOR alias),\n
                the result is as though the write from core 0 took place first,\n
                and the write from core 1 was then applied to that intermediate result.</description>
              <name>GPIO_HI_OUT</name>
            </field>
          </fields>
          <name>GPIO_HI_OUT</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0034</addressOffset>
          <description>QSPI output value set</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[5:0]</bitRange>
              <description>Perform an atomic bit-set on GPIO_HI_OUT, i.e. `GPIO_HI_OUT |= wdata`</description>
              <name>GPIO_HI_OUT_SET</name>
            </field>
          </fields>
          <name>GPIO_HI_OUT_SET</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0038</addressOffset>
          <description>QSPI output value clear</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[5:0]</bitRange>
              <description>Perform an atomic bit-clear on GPIO_HI_OUT, i.e. `GPIO_HI_OUT &amp;= ~wdata`</description>
              <name>GPIO_HI_OUT_CLR</name>
            </field>
          </fields>
          <name>GPIO_HI_OUT_CLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x003c</addressOffset>
          <description>QSPI output value XOR</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[5:0]</bitRange>
              <description>Perform an atomic bitwise XOR on GPIO_HI_OUT, i.e. `GPIO_HI_OUT ^= wdata`</description>
              <name>GPIO_HI_OUT_XOR</name>
            </field>
          </fields>
          <name>GPIO_HI_OUT_XOR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0040</addressOffset>
          <description>QSPI output enable</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[5:0]</bitRange>
              <description>Set output enable (1/0 -&gt; output/input) for QSPI IO0...5.\n
                Reading back gives the last value written.\n
                If core 0 and core 1 both write to GPIO_HI_OE simultaneously (or to a SET/CLR/XOR alias),\n
                the result is as though the write from core 0 took place first,\n
                and the write from core 1 was then applied to that intermediate result.</description>
              <name>GPIO_HI_OE</name>
            </field>
          </fields>
          <name>GPIO_HI_OE</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0044</addressOffset>
          <description>QSPI output enable set</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[5:0]</bitRange>
              <description>Perform an atomic bit-set on GPIO_HI_OE, i.e. `GPIO_HI_OE |= wdata`</description>
              <name>GPIO_HI_OE_SET</name>
            </field>
          </fields>
          <name>GPIO_HI_OE_SET</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0048</addressOffset>
          <description>QSPI output enable clear</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[5:0]</bitRange>
              <description>Perform an atomic bit-clear on GPIO_HI_OE, i.e. `GPIO_HI_OE &amp;= ~wdata`</description>
              <name>GPIO_HI_OE_CLR</name>
            </field>
          </fields>
          <name>GPIO_HI_OE_CLR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x004c</addressOffset>
          <description>QSPI output enable XOR</description>
          <fields>
            <field>
              <access>write-only</access>
              <bitRange>[5:0]</bitRange>
              <description>Perform an atomic bitwise XOR on GPIO_HI_OE, i.e. `GPIO_HI_OE ^= wdata`</description>
              <name>GPIO_HI_OE_XOR</name>
            </field>
          </fields>
          <name>GPIO_HI_OE_XOR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0050</addressOffset>
          <description>Status register for inter-core FIFOs (mailboxes).\n
            There is one FIFO in the core 0 -&gt; core 1 direction, and one core 1 -&gt; core 0. Both are 32 bits wide and 8 words deep.\n
            Core 0 can see the read side of the 1-&gt;0 FIFO (RX), and the write side of 0-&gt;1 FIFO (TX).\n
            Core 1 can see the read side of the 0-&gt;1 FIFO (RX), and the write side of 1-&gt;0 FIFO (TX).\n
            The SIO IRQ for each core is the logical OR of the VLD, WOF and ROE fields of its FIFO_ST register.</description>
          <fields>
            <field>
              <access>read-write</access>
              <bitRange>[3:3]</bitRange>
              <description>Sticky flag indicating the RX FIFO was read when empty. This read was ignored by the FIFO.</description>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>ROE</name>
            </field>
            <field>
              <access>read-write</access>
              <bitRange>[2:2]</bitRange>
              <description>Sticky flag indicating the TX FIFO was written when full. This write was ignored by the FIFO.</description>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <name>WOF</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>Value is 1 if this core's TX FIFO is not full (i.e. if FIFO_WR is ready for more data)</description>
              <name>RDY</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Value is 1 if this core's RX FIFO is not empty (i.e. if FIFO_RD is valid)</description>
              <name>VLD</name>
            </field>
          </fields>
          <name>FIFO_ST</name>
          <resetValue>0x00000002</resetValue>
        </register>
        <register>
          <access>write-only</access>
          <addressOffset>0x0054</addressOffset>
          <description>Write access to this core's TX FIFO</description>
          <name>FIFO_WR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0058</addressOffset>
          <description>Read access to this core's RX FIFO</description>
          <name>FIFO_RD</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x005c</addressOffset>
          <description>Spinlock state\n
            A bitmap containing the state of all 32 spinlocks (1=locked).\n
            Mainly intended for debugging.</description>
          <name>SPINLOCK_ST</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0060</addressOffset>
          <description>Divider unsigned dividend\n
            Write to the DIVIDEND operand of the divider, i.e. the p in `p / q`.\n
            Any operand write starts a new calculation. The results appear in QUOTIENT, REMAINDER.\n
            UDIVIDEND/SDIVIDEND are aliases of the same internal register. The U alias starts an\n
            unsigned calculation, and the S alias starts a signed calculation.</description>
          <name>DIV_UDIVIDEND</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0064</addressOffset>
          <description>Divider unsigned divisor\n
            Write to the DIVISOR operand of the divider, i.e. the q in `p / q`.\n
            Any operand write starts a new calculation. The results appear in QUOTIENT, REMAINDER.\n
            UDIVISOR/SDIVISOR are aliases of the same internal register. The U alias starts an\n
            unsigned calculation, and the S alias starts a signed calculation.</description>
          <name>DIV_UDIVISOR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0068</addressOffset>
          <description>Divider signed dividend\n
            The same as UDIVIDEND, but starts a signed calculation, rather than unsigned.</description>
          <name>DIV_SDIVIDEND</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x006c</addressOffset>
          <description>Divider signed divisor\n
            The same as UDIVISOR, but starts a signed calculation, rather than unsigned.</description>
          <name>DIV_SDIVISOR</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0070</addressOffset>
          <description>Divider result quotient\n
            The result of `DIVIDEND / DIVISOR` (division). Contents undefined while CSR_READY is low.\n
            For signed calculations, QUOTIENT is negative when the signs of DIVIDEND and DIVISOR differ.\n
            This register can be written to directly, for context save/restore purposes. This halts any\n
            in-progress calculation and sets the CSR_READY and CSR_DIRTY flags.\n
            Reading from QUOTIENT clears the CSR_DIRTY flag, so should read results in the order\n
            REMAINDER, QUOTIENT if CSR_DIRTY is used.</description>
          <name>DIV_QUOTIENT</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0074</addressOffset>
          <description>Divider result remainder\n
            The result of `DIVIDEND % DIVISOR` (modulo). Contents undefined while CSR_READY is low.\n
            For signed calculations, REMAINDER is negative only when DIVIDEND is negative.\n
            This register can be written to directly, for context save/restore purposes. This halts any\n
            in-progress calculation and sets the CSR_READY and CSR_DIRTY flags.</description>
          <name>DIV_REMAINDER</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <addressOffset>0x0078</addressOffset>
          <description>Control and status register for divider.</description>
          <fields>
            <field>
              <access>read-only</access>
              <bitRange>[1:1]</bitRange>
              <description>Changes to 1 when any register is written, and back to 0 when QUOTIENT is read.\n
                Software can use this flag to make save/restore more efficient (skip if not DIRTY).\n
                If the flag is used in this way, it's recommended to either read QUOTIENT only,\n
                or REMAINDER and then QUOTIENT, to prevent data loss on context switch.</description>
              <name>DIRTY</name>
            </field>
            <field>
              <access>read-only</access>
              <bitRange>[0:0]</bitRange>
              <description>Reads as 0 when a calculation is in progress, 1 otherwise.\n
                Writing an operand (xDIVIDEND, xDIVISOR) will immediately start a new calculation, no\n
                matter if one is already in progress.\n
                Writing to a result register will immediately terminate any in-progress calculation\n
                and set the READY and DIRTY flags.</description>
              <name>READY</name>
            </field>
          </fields>
          <name>DIV_CSR</name>
          <resetValue>0x00000001</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0080</addressOffset>
          <description>Read/write access to accumulator 0</description>
          <name>INTERP0_ACCUM0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0084</addressOffset>
          <description>Read/write access to accumulator 1</description>
          <name>INTERP0_ACCUM1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0088</addressOffset>
          <description>Read/write access to BASE0 register.</description>
          <name>INTERP0_BASE0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x008c</addressOffset>
          <description>Read/write access to BASE1 register.</description>
          <name>INTERP0_BASE1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0090</addressOffset>
          <description>Read/write access to BASE2 register.</description>
          <name>INTERP0_BASE2</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0094</addressOffset>
          <description>Read LANE0 result, and simultaneously write lane results to both accumulators (POP).</description>
          <name>INTERP0_POP_LANE0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x0098</addressOffset>
          <description>Read LANE1 result, and simultaneously write lane results to both accumulators (POP).</description>
          <name>INTERP0_POP_LANE1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x009c</addressOffset>
          <description>Read FULL result, and simultaneously write lane results to both accumulators (POP).</description>
          <name>INTERP0_POP_FULL</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x00a0</addressOffset>
          <description>Read LANE0 result, without altering any internal state (PEEK).</description>
          <name>INTERP0_PEEK_LANE0</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x00a4</addressOffset>
          <description>Read LANE1 result, without altering any internal state (PEEK).</description>
          <name>INTERP0_PEEK_LANE1</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-only</access>
          <addressOffset>0x00a8</addressOffset>
          <description>Read FULL result, without altering any internal state (PEEK).</description>
          <name>INTERP0_PEEK_FULL</name>
          <resetValue>0x00000000</resetValue>
        </register>
