qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/rp2040.svd
        <register>
          <access>read-write</access>
          <addressOffset>0x0110</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK4</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0114</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK5</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0118</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK6</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x011c</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK7</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0120</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK8</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0124</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK9</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0128</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK10</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x012c</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK11</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0130</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK12</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0134</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK13</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0138</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK14</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x013c</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK15</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0140</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK16</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0144</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK17</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0148</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK18</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x014c</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK19</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0150</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK20</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0154</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK21</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0158</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK22</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x015c</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK23</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0160</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK24</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0164</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK25</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0168</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK26</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x016c</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK27</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0170</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK28</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0174</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK29</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x0178</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK30</name>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <access>read-write</access>
          <addressOffset>0x017c</addressOffset>
          <description>Reading from a spinlock address will:\n
            - Return 0 if lock is already locked\n
            - Otherwise return nonzero, and simultaneously claim the lock\n\n
            Writing (any value) releases the lock.\n
            If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.\n
            The value returned on success is 0x1 &lt;&lt; lock number.</description>
          <name>SPINLOCK31</name>
          <resetValue>0x00000000</resetValue>
        </register>
